<a href="https://colab.research.google.com/github/JasonSCFu/Python-basics/blob/main/Creating_a_new_column_based_on_if_elif_else_condition.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

The little notebook is to summerize different ways of creating new column based on if else condition for pandas dataframe.

Source: https://stackoverflow.com/questions/21702342/creating-a-new-column-based-on-if-elif-else-condition
https://www.dataquest.io/blog/tutorial-add-column-pandas-dataframe-based-on-if-else-condition/

In [2]:
import numpy as np
import pandas as pd

In [23]:
data = {'A':[1,2, 3, 4],'B':[2, 2, 1, 1]}
df = pd.DataFrame(data)

In [11]:
df

   A  B
0  1  2
1  2  2
2  3  1
3  4  1

In [12]:
# method 1: using function
def f(row):
    if row['A'] == row['B']:
        val = 0
    elif row['A'] > row['B']:
        val = 1
    else:
        val = -1
    return val
df['C'] = df.apply(f, axis=1)
df

   A  B  C
0  1  2 -1
1  2  2  0
2  3  1  1
3  4  1  1

In [19]:
# method 2: vectorized version
df['C'] = np.where(
    df['A'] == df['B'], 0, np.where(
    df['A'] >  df['B'], 1, -1))
df

   A  B  C
0  1  2 -1
1  2  2  0
2  3  1  1
3  4  1  1

In [16]:
# method 3: use loc index
df.loc[df['A'] == df['B'], 'C'] = 0
df.loc[df['A'] > df['B'], 'C'] = 1
df.loc[df['A'] < df['B'], 'C'] = -1
df

   A  B  C
0  1  2 -1
1  2  2  0
2  3  1  1
3  4  1  1

In [22]:
# method 4:use numpy.select
import numpy as np
conditions = [df.A.eq(df.B), df.A.gt(df.B), df.A.lt(df.B)]
choices = [0, 1, -1]
df['C'] = np.select(conditions, choices)
df

   A  B  C
0  1  2 -1
1  2  2  0
2  3  1  1
3  4  1  1

In [24]:
# method 5: use mask method
df['C'] = np.nan
df['C'] = df['C'].mask(df.A == df.B, 0).mask(df.A > df.B, 1).mask(df.A < df.B, -1)
df

   A  B    C
0  1  2 -1.0
1  2  2  0.0
2  3  1  1.0
3  4  1  1.0